### Imports Libraries

In [261]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder

### Prepare dataset using pandas

In [262]:
data = {
    'Job_Title': ["Data Scientist", "Software Engineering", "Market Manager", "Graphic Designer", "Data Scientist"],
    'Experience': [5, 2, np.nan, 1, 8],
    'Salary': [120, 80, 95, 50, 1500],
    'Remote': ['yes', 'no', 'yes', 'no', np.nan]
}
df =  pd.DataFrame(data)

In [263]:
df.head()

              Job_Title  Experience  Salary Remote
0        Data Scientist         5.0     120    yes
1  Software Engineering         2.0      80     no
2        Market Manager         NaN      95    yes
3      Graphic Designer         1.0      50     no
4        Data Scientist         8.0    1500    NaN

### Prints Atrribute names along with number of empty tuple count

In [264]:
print('Atrribute - Total Empty')
print('-----------------------')
print(df.isnull().sum())

Atrribute - Total Empty
-----------------------
Job_Title     0
Experience    1
Salary        0
Remote        1
dtype: int64

### Filled empty tuples of 'Experience' attribute using mean value and 'Remote' attribute using mode value

In [265]:
df['Experience'] = df['Experience'].fillna(df['Experience'].mean())
df['Remote'] = df['Remote'].fillna(df['Remote'].mode()[0])
df

              Job_Title  Experience  Salary Remote
0        Data Scientist         5.0     120    yes
1  Software Engineering         2.0      80     no
2        Market Manager         4.0      95    yes
3      Graphic Designer         1.0      50     no
4        Data Scientist         8.0    1500     no

### Normalized/Scaled 'Experience' and 'Salary' using min-max normalization

In [266]:
df['Min_Max_Scaled_Experience'] = (df['Experience'] - df['Experience'].min()) / (df['Experience'].max() - df['Experience'].min())
df['Min_Max_Scaled_Salary'] = (df['Salary'] - df['Salary'].min()) / (df['Salary'].max() - df['Salary'].min())

In [267]:
df.head()

,Job_Title,Experience,Salary,Remote,Min_Max_Scaled_Experience,Min_Max_Scaled_Salary
0,Data Scientist,5.0,120,yes,0.571429,0.048276
1,Software Engineering,2.0,80,no,0.142857,0.020690
2,Market Manager,4.0,95,yes,0.428571,0.031034
3,Graphic Designer,1.0,50,no,0.000000,0.000000
4,Data Scientist,8.0,1500,no,1.000000,1.000000

### Encoded job titles using label encoder

In [268]:
le = LabelEncoder()
df['Encoded_Job_Title'] = le.fit_transform(df['Job_Title'])
df.head()

,Job_Title,Experience,Salary,Remote,Min_Max_Scaled_Experience,Min_Max_Scaled_Salary,Encoded_Job_Title
0,Data Scientist,5.0,120,yes,0.571429,0.048276,0
1,Software Engineering,2.0,80,no,0.142857,0.020690,3
2,Market Manager,4.0,95,yes,0.428571,0.031034,2
3,Graphic Designer,1.0,50,no,0.000000,0.000000,1
4,Data Scientist,8.0,1500,no,1.000000,1.000000,0